SCORE_WEIGHTS = {
    'G01': 100,
    'G03': 100,
    'G04': 100,
    'G05': 100,
    'G07': 100,
    'G08': 100,
    'G10': 100,
    'G12': 100,
    'G17': 9,
    'G18': 18,
    'G19': 18,
    'G20': 15,
    'G23': 6,
    'G25': 6,
    'G26': 6,
}


SCORE_COLUMNS = [
    'G01_遵循核身与信息保密性_评分', 'G01_遵循核身与信息保密性_评分理由',
    'G03_遵循内部资料保密性_评分', 'G03_遵循内部资料保密性_评分理由',
    'G04_遵循客户信息保密性_评分', 'G04_遵循客户信息保密性_评分理由',
    'G05_情感反应得当_评分', 'G05_情感反应得当_评分理由',
    'G07_交流的语种一致性_评分', 'G07_交流的语种一致性_评分理由',
    'G08_跨团队转交准确性_评分', 'G08_跨团队转交准确性_评分理由',
    'G10_无过度承诺_评分', 'G10_无过度承诺_评分理由',
    'G12_回答切题_评分', 'G12_回答切题_评分理由',
    'G17_回复简洁_评分', 'G17_回复简洁_评分理由',
    'G18_是否完全理解用户意图_评分', 'G18_是否完全理解用户意图_评分理由',
    'G18_信息正确_评分', 'G18_信息正确_评分理由',
    'G18_前后表达一致_评分', 'G18_前后表达一致_评分理由',
    'G19_有效推进_评分', 'G19_有效推进_评分理由',
    'G19_上下文记忆_评分', 'G19_上下文记忆_评分理由',
    'G19_主题遵从_评分', 'G19_主题遵从_评分理由',
    'G19_主题切换_评分', 'G19_主题切换_评分理由',
    'G20_核身场景必要性与问题清单合规性_评分', 'G20_核身场景必要性与问题清单合规性_评分理由',
    'G23_客户认知纠正与政策解释_评分', 'G23_客户认知纠正与政策解释_评分理由',
    'G25_服务礼貌_评分', 'G25_服务礼貌_评分理由',
    'G26_语言流畅性_评分', 'G26_语言流畅性_评分理由'
]


def get_score_columns(dims):
    if not dims:
        return SCORE_COLUMNS
    temp_score_columns = []
    for key in dims:
        for col in SCORE_COLUMNS:
            if key in col:
                temp_score_columns.append(col)
    return temp_score_columns
